In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
file='ice_cream.csv'
data=pd.read_csv(file)
print(data.dtypes,'\n',data.shape)
data.head()

DATE          object
IPN31152N    float64
dtype: object
 (577, 2)

         DATE  IPN31152N
0  1972-01-01    59.9622
1  1972-02-01    67.0605
2  1972-03-01    74.2350
3  1972-04-01    78.1120
4  1972-05-01    84.7636

In [3]:
#changing column names
data.columns=['date','production']

In [4]:
#Converting date to datetime
data['date']=pd.to_datetime(data['date'])

In [5]:
#Seeting date column as index
data.set_index('date',inplace=True)

In [6]:
data

            production
date
1972-01-01     59.9622
1972-02-01     67.0605
1972-03-01     74.2350
1972-04-01     78.1120
1972-05-01     84.7636
...                ...
2019-09-01    100.1741
2019-10-01     90.1684
2019-11-01     79.7223
2019-12-01     75.7094
2020-01-01     83.6290

[577 rows x 1 columns]

In [7]:
mask=data.index.year>=2010
data[mask]

            production
date
2010-01-01     91.2895
2010-02-01    110.4994
2010-03-01    127.0971
2010-04-01    132.6468
2010-05-01    134.5576
...                ...
2019-09-01    100.1741
2019-10-01     90.1684
2019-11-01     79.7223
2019-12-01     75.7094
2020-01-01     83.6290

[121 rows x 1 columns]